HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/driver_interfaces/r_flash_spi_drvif.c
/***********************************************************************************************************************
* Copyright (c) 2014 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
* System Name  : FLASH SPI driver software
* File Name    : r_flash_spi_drvif.c
* Version      : 3.51
* Device       : -
* Abstract     : IO I/F module
* Tool-Chain   : -
* OS           : not use
* H/W Platform : -
* Description  : SPI FLASH I/O file
* Limitation   : none
***********************************************************************************************************************/
/***********************************************************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 23.07.2014 2.21     Created
*              : 29.05.2015 2.32     Revised functions of same as Ver.2.32 of EEPROM SPI FIT module.
*              : 21.12.2018 3.00     Change flash drive interface to Memory Access Driver Interface
*              : 31.12.2021 3.03     Added variable "read_after_write" "read_after_write_add" and
*                                    "read_after_write_data" for controlling SPI bus.
*              : 30.06.2022 3.10     Fixed issues of wrong conditional expression in the if statement.
*              : 16.03.2023 3.20     Added the QSPIX Memory Mapped Mode.
*              : 15.11.2023 3.40     Updated according to GSCE Code Checker 6.50.
*              : 15.03.2025 3.51     Updated disclaimer.
***********************************************************************************************************************/


/************************************************************************************************
Includes <System Includes> , "Project Includes"
*************************************************************************************************/
#include "r_flash_spi_if.h"                      /* FLASH driver I/F definitions                 */
#include "r_flash_spi_config.h"                  /* FLASH driver Configuration definitions       */
#include "r_memdrv_rx_if.h"                      /* MEMORY driver I/F definitions                */
#include "../r_flash_spi_private.h"              /* FLASH driver Private module definitions      */


/************************************************************************************************
Macro definitions
*************************************************************************************************/


/************************************************************************************************
Typedef definitions
*************************************************************************************************/


/************************************************************************************************
Exported global variables (to be accessed by other files)
*************************************************************************************************/


/************************************************************************************************
Private global variables and functions
*************************************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_open
* Description  : Initializes I/O driver.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_open(uint8_t devno)
{
    memdrv_err_t     ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t memdrv_info;

    memdrv_info.cnt     = 0;
    memdrv_info.p_data  = NULL;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;

    ret_drv = R_MEMDRV_Open(devno, &memdrv_info);

    if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_open
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_open_tx_data
* Description  : Initializes I/O driver for writing data.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_open_tx_data(uint8_t devno)
{
    memdrv_err_t     ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t memdrv_info;

    memdrv_info.cnt     = 0;
    memdrv_info.p_data  = NULL;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;

    ret_drv = R_MEMDRV_Open(devno, &memdrv_info);

     if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_open_tx_data
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_open_rx_data
* Description  : Initializes I/O driver for reading data.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_open_rx_data(uint8_t devno)
{
    memdrv_err_t     ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t memdrv_info;

    memdrv_info.cnt     = 0;
    memdrv_info.p_data  = NULL;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;

    ret_drv = R_MEMDRV_Open(devno, &memdrv_info);

