HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/driver_interfaces/r_flash_spi_drvif.c
    if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_open_rx_data
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_close
* Description  : Resets I/O driver.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_close(uint8_t devno)
{
    memdrv_err_t      ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t  memdrv_info;

    memdrv_info.cnt      = 0;
    memdrv_info.p_data   = NULL;
    memdrv_info.io_mode  = MEMDRV_MODE_SINGLE;

    ret_drv = R_MEMDRV_Close(devno, &memdrv_info);

     if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_close
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_close_tx_data
* Description  : Resets I/O driver for writing data.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_close_tx_data(uint8_t devno)
{
    memdrv_err_t     ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t memdrv_info;

    memdrv_info.cnt     = 0;
    memdrv_info.p_data  = NULL;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;

    ret_drv = R_MEMDRV_Close(devno, &memdrv_info);

     if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_close_tx_data
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_close_rx_data
* Description  : Resets I/O driver for reading data.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_close_rx_data(uint8_t devno)
{
    memdrv_err_t     ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t memdrv_info;

    memdrv_info.cnt     = 0;
    memdrv_info.p_data  = NULL;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;

    ret_drv = R_MEMDRV_Close(devno, &memdrv_info);

     if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_close_rx_data
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_disable
* Description  : Disables I/O driver.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_disable(uint8_t devno)
{
    memdrv_err_t     ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t memdrv_info;

    memdrv_info.cnt     = 0;
    memdrv_info.p_data  = NULL;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;

    ret_drv = R_MEMDRV_Disable(devno, &memdrv_info);

     if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_disable
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_enable
* Description  : Enables I/O driver.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_enable(uint8_t devno)
{
    memdrv_err_t     ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t memdrv_info;

    memdrv_info.cnt     = 0;
    memdrv_info.p_data  = NULL;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;

