HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/driver_interfaces/r_flash_spi_drvif.c
    ret_drv = R_MEMDRV_Enable(devno, &memdrv_info);

     if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_enable
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_enable_tx_data
* Description  : Enables I/O driver for writing data.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_enable_tx_data(uint8_t devno)
{
    memdrv_err_t ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t  memdrv_info;

    memdrv_info.cnt = 0;
    memdrv_info.p_data = NULL;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;

    ret_drv = R_MEMDRV_EnableTxData(devno, &memdrv_info);

     if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_enable_tx_data
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_enable_rx_data
* Description  : Enables I/O driver for reading data.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_enable_rx_data(uint8_t devno)
{
    memdrv_err_t ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t  memdrv_info;

    memdrv_info.cnt     = 0;
    memdrv_info.p_data  = NULL;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;

    ret_drv = R_MEMDRV_EnableRxData(devno, &memdrv_info);

     if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_enable_rx_data
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_tx
* Description  : Transmits data for command and status register.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
*              : uint32_t        txcnt                       ;   Number of bytes to be write
*              : uint8_t       * p_data                      ;   Write data storage buffer pointer
*              : bool            read_after_write            ;   Control SPI bus
*              : bool            read_in_memory_mapped       ;   Read access in memory-mapped mode
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_HARD                          ;   Hardware error
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_tx(uint8_t devno, uint32_t txcnt, uint8_t * p_data, bool read_after_write, bool read_in_memory_mapped)
{
    memdrv_err_t ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t  memdrv_info;

    memdrv_info.cnt     = txcnt;
    memdrv_info.p_data  = p_data;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;
    memdrv_info.read_after_write = read_after_write;
    memdrv_info.read_in_memory_mapped = read_in_memory_mapped;

    ret_drv = R_MEMDRV_Tx(devno, &memdrv_info);

    if (MEMDRV_ERR_HARD == ret_drv)
    {
        return FLASH_SPI_ERR_HARD;
    } 
    else if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    else
    {
        /* Do nothing */
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_tx
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_tx_add
* Description  : Transmits data for address.
* Arguments    : uint8_t            devno                    ;   Device No. (FLASH_SPI_DEVn)
*              : uint32_t           txcnt                    ;   Number of bytes to be write
*              : uint8_t          * p_data                   ;   Write data storage buffer pointer
*              : flash_spi_opmode_t op_mode                  ;   SPI mode
*              : bool               read_after_write_add     ;   Whether or not to close SPI bus cycle
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_HARD                          ;   Hardware error
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_tx_add(uint8_t devno, uint32_t txcnt, uint8_t * p_data, flash_spi_opmode_t op_mode, bool read_after_write_add)
{
    memdrv_err_t ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t  memdrv_info;

    memdrv_info.cnt     = txcnt;
    memdrv_info.p_data  = p_data;
    memdrv_info.read_after_write = read_after_write_add;

