HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/driver_interfaces/r_flash_spi_drvif.c
    switch (op_mode)
    {
        case FLASH_SPI_SINGLE:
            memdrv_info.io_mode = MEMDRV_MODE_SINGLE;
            break;
        case FLASH_SPI_DUAL:
            memdrv_info.io_mode = MEMDRV_MODE_DUAL;
            break;
        case FLASH_SPI_QUAD:
            memdrv_info.io_mode = MEMDRV_MODE_QUAD;
            break;
        default:
            memdrv_info.io_mode = MEMDRV_MODE_SINGLE;
            break;
    } 

    ret_drv = R_MEMDRV_TxData(devno, &memdrv_info);

    if (MEMDRV_ERR_HARD == ret_drv)
    {
        return FLASH_SPI_ERR_HARD;
    } 
    else if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    else
    {
        /* Do nothing */
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_tx_add
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_tx_data
* Description  : Transmits data using the single mode.
* Arguments    : uint8_t            devno                    ;   Device No. (FLASH_SPI_DEVn)
*              : uint32_t           txcnt                    ;   Number of bytes to be write
*              : uint8_t          * p_data                   ;   Write data storage buffer pointer
*              : flash_spi_opmode_t op_mode                  ;   SPI mode
*              : bool               read_after_write_data    ;   Whether or not to close SPI bus cycle
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_HARD                          ;   Hardware error
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_tx_data(uint8_t devno, uint32_t txcnt, uint8_t * p_data, flash_spi_opmode_t op_mode, bool read_after_write_data)
{
    memdrv_err_t ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t  memdrv_info;

    memdrv_info.cnt     = txcnt;
    memdrv_info.p_data  = p_data;
    memdrv_info.read_after_write = read_after_write_data;

    switch (op_mode)
    {
        case FLASH_SPI_SINGLE:
            memdrv_info.io_mode = MEMDRV_MODE_SINGLE;
            break;
        case FLASH_SPI_DUAL:
            memdrv_info.io_mode = MEMDRV_MODE_DUAL;
            break;
        case FLASH_SPI_QUAD:
            memdrv_info.io_mode = MEMDRV_MODE_QUAD;
            break;
        default:
            memdrv_info.io_mode = MEMDRV_MODE_SINGLE;
            break;
    }

    ret_drv = R_MEMDRV_TxData(devno, &memdrv_info);

    if (MEMDRV_ERR_HARD == ret_drv)
    {
        return FLASH_SPI_ERR_HARD;
    } 
    else if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    else
    {
        /* Do nothing */
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_tx_data
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_rx
* Description  : Receives data for status register and Read ID.
* Arguments    : uint8_t         devno                       ;   Device No. (FLASH_SPI_DEVn)
*              : uint32_t        rxcnt                       ;   Number of bytes to be read
*              : uint8_t       * p_data                      ;   Read data storage buffer pointer
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_HARD                          ;   Hardware error
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_rx(uint8_t devno, uint32_t rxcnt, uint8_t * p_data)
{
    memdrv_err_t ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t  memdrv_info;

    memdrv_info.cnt     = rxcnt;
    memdrv_info.p_data  = p_data;
    memdrv_info.io_mode = MEMDRV_MODE_SINGLE;

    ret_drv = R_MEMDRV_Rx(devno, &memdrv_info);

    if (MEMDRV_ERR_HARD == ret_drv)
    {
        return FLASH_SPI_ERR_HARD;
    } 
    else if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    else
    {
        /* Do nothing */
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_rx
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_rx_add
* Description  : Receives data for address.
* Arguments    : uint8_t            devno                    ;   Device No. (FLASH_SPI_DEVn)
*              : uint32_t           rxcnt                    ;   Number of bytes to be read
*              : uint8_t          * p_data                   ;   Read data storage buffer pointer
*              : flash_spi_opmode_t op_mode                  ;   SPI mode
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_HARD                          ;   Hardware error
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_rx_add(uint8_t devno, uint32_t rxcnt, uint8_t * p_data, flash_spi_opmode_t op_mode)
{
    memdrv_err_t ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t  memdrv_info;

    memdrv_info.cnt     = rxcnt;
    memdrv_info.p_data  = p_data;

