HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/driver_interfaces/r_flash_spi_drvif.c
    switch (op_mode)
    {
        case FLASH_SPI_SINGLE:
            memdrv_info.io_mode = MEMDRV_MODE_SINGLE;
            break;
        case FLASH_SPI_DUAL:
            memdrv_info.io_mode = MEMDRV_MODE_DUAL;
            break;
        case FLASH_SPI_QUAD:
            memdrv_info.io_mode = MEMDRV_MODE_QUAD;
            break;
        default:
            memdrv_info.io_mode = MEMDRV_MODE_SINGLE;
            break;
    }

    ret_drv = R_MEMDRV_RxData(devno, &memdrv_info);

    if (MEMDRV_ERR_HARD == ret_drv)
    {
        return FLASH_SPI_ERR_HARD;
    } 
    else if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    else
    {
        /* Do nothing */
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_rx_add
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_rx_data
* Description  : Receives data using the single mode.
* Arguments    : uint8_t            devno                    ;   Device No. (FLASH_SPI_DEVn)
*              : uint32_t           rxcnt                    ;   Number of bytes to be read
*              : uint8_t          * p_data                   ;   Read data storage buffer pointer
*              : uint32_t           p_addr                   ;   Read start address
*              : uint8_t            addr_size                ;   Address size
*              : flash_spi_opmode_t op_mode                  ;   SPI mode
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*              : FLASH_SPI_ERR_HARD                          ;   Hardware error
*              : FLASH_SPI_ERR_OTHER                         ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_rx_data(uint8_t devno, uint32_t rxcnt, uint8_t * p_data, uint32_t p_addr, uint8_t addr_size, flash_spi_opmode_t op_mode)
{
    memdrv_err_t     ret_drv = MEMDRV_SUCCESS;
    st_memdrv_info_t memdrv_info;

    memdrv_info.cnt     = rxcnt;
    memdrv_info.p_data  = p_data;
    memdrv_info.p_addr  = p_addr;

    switch (op_mode)
    {
        case FLASH_SPI_SINGLE:
            memdrv_info.io_mode = MEMDRV_MODE_SINGLE;
            break;
        case FLASH_SPI_DUAL:
            memdrv_info.io_mode = MEMDRV_MODE_DUAL;
            break;
        case FLASH_SPI_QUAD:
            memdrv_info.io_mode = MEMDRV_MODE_QUAD;
            break;
        default:
            memdrv_info.io_mode = MEMDRV_MODE_SINGLE;
            break;
    }

    switch (addr_size)
    {
        case FLASH_SPI_ADDR_4BYTES:
            memdrv_info.addr_size = MEMDRV_ADDR_4BYTES;
            break;
        case FLASH_SPI_ADDR_3BYTES:
            memdrv_info.addr_size = MEMDRV_ADDR_3BYTES;
            break;
        default:
            memdrv_info.addr_size = MEMDRV_ADDR_3BYTES;
            break;
    }

    ret_drv = R_MEMDRV_RxData(devno, &memdrv_info);

    if (MEMDRV_ERR_HARD == ret_drv)
    {
        return FLASH_SPI_ERR_HARD;
    } 
    else if (MEMDRV_SUCCESS > ret_drv)
    {
        return FLASH_SPI_ERR_OTHER;
    }
    else
    {
        /* Do nothing */
    }
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_rx_data
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_1ms_interval
* Description  : 1ms Interval Timer call function for driver interface.
* Arguments    : None
* Return Value : None
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
void r_flash_spi_drvif_1ms_interval(void)
{
    R_MEMDRV_1msInterval();
}
/******************************************************************************
 End of function r_flash_spi_drvif_1ms_interval
 *****************************************************************************/


/************************************************************************************************
* Function Name: r_flash_spi_drvif_set_loghdladdress
* Description  : Sets handler address for driver interface.
* Arguments    : uint32_t           user_long_que           ;   Handler address
* Return Value : FLASH_SPI_SUCCESS                           ;   Successful operation
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_drvif_set_loghdladdress(uint32_t user_long_que)
{
    R_MEMDRV_SetLogHdlAddress(user_long_que);
    return FLASH_SPI_SUCCESS;
}
/******************************************************************************
 End of function r_flash_spi_drvif_set_loghdladdress
 *****************************************************************************/


/* End of File */
